redis_test_for_auto_numa_problem/redis_test_result_L_ON_120G_4nd/memtier_benchmark_L_ON_120G_4nd_Sequential110_P1_20230705002332.log
20        Threads
5         Connections per thread
900       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       152218.82          ---          ---        19.12638        19.45500        22.52700        26.11100    315614.57 
Gets        15221.81     15221.81         0.00        18.88154        19.32700        22.52700        25.98300     31472.12 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     167440.63     15221.81         0.00        19.10412        19.45500        22.52700        26.11100    347086.69 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.303        0.000
SET      14.399        5.000
SET      15.551       10.000
SET      17.919       15.000
SET      18.303       20.000
SET      18.559       25.000
SET      18.815       30.000
SET      18.943       35.000
SET      19.199       40.000
SET      19.327       45.000
SET      19.455       50.000
SET      19.583       52.500
SET      19.583       55.000
SET      19.711       57.500
SET      19.839       60.000
SET      19.839       62.500
SET      19.967       65.000
SET      19.967       67.500
SET      20.095       70.000
SET      20.223       72.500
SET      20.223       75.000
SET      20.351       76.250
SET      20.351       77.500
SET      20.351       78.750
SET      20.479       80.000
SET      20.479       81.250
SET      20.607       82.500
SET      20.607       83.750
SET      20.735       85.000
SET      20.735       86.250
SET      20.863       87.500
SET      20.863       88.125
SET      20.863       88.750
SET      20.991       89.375
SET      20.991       90.000
SET      20.991       90.625
SET      21.119       91.250
SET      21.119       91.875
SET      21.119       92.500
SET      21.247       93.125
SET      21.247       93.750
SET      21.375       94.062
SET      21.375       94.375
SET      21.375       94.688
SET      21.375       95.000
SET      21.503       95.312
SET      21.503       95.625
SET      21.503       95.938
SET      21.631       96.250
SET      21.631       96.562
SET      21.759       96.875
SET      21.759       97.031
SET      21.759       97.188
SET      21.759       97.344
SET      21.887       97.500
SET      21.887       97.656
SET      21.887       97.812
SET      22.015       97.969
SET      22.015       98.125
SET      22.143       98.281
SET      22.143       98.438
SET      22.143       98.516
SET      22.271       98.594
SET      22.271       98.672
SET      22.399       98.750
SET      22.399       98.828
SET      22.527       98.906
SET      22.527       98.984
SET      22.655       99.062
SET      22.783       99.141
SET      22.911       99.219
SET      23.039       99.258
SET      23.167       99.297
SET      23.295       99.336
SET      23.423       99.375
SET      23.679       99.414
SET      23.807       99.453
SET      24.063       99.492
SET      24.319       99.531
SET      24.447       99.570
SET      24.703       99.609
SET      24.831       99.629
SET      24.831       99.648
SET      24.959       99.668
SET      24.959       99.688
SET      25.087       99.707
SET      25.087       99.727
SET      25.215       99.746
SET      25.215       99.766
SET      25.343       99.785
SET      25.471       99.805
SET      25.471       99.814
SET      25.599       99.824
SET      25.599       99.834
SET      25.727       99.844
SET      25.727       99.854
SET      25.855       99.863
SET      25.855       99.873
SET      25.983       99.883
SET      25.983       99.893
SET      26.111       99.902
SET      26.111       99.907
SET      26.239       99.912
SET      26.239       99.917
SET      26.239       99.922
SET      26.367       99.927
SET      26.367       99.932
SET      26.495       99.937
SET      26.495       99.941
SET      26.623       99.946
SET      26.751       99.951
SET      26.879       99.954
SET      27.007       99.956
SET      27.263       99.958
SET      27.903       99.961
SET      28.415       99.963
SET      28.671       99.966
SET      29.311       99.968
SET      29.951       99.971
SET      30.719       99.973
SET      31.487       99.976
SET      32.127       99.977
SET      32.511       99.978
SET     307.199       99.979
SET     313.343       99.980
SET     313.343       99.982
SET     317.439       99.983
SET     317.439       99.984
SET     319.487       99.985
SET     321.535       99.987
SET     321.535       99.988
SET     321.535       99.988
SET     323.583       99.989
SET     323.583       99.990
SET     323.583       99.990
SET     323.583       99.991
SET     323.583       99.991
SET     323.583       99.992
SET     323.583       99.993
SET     325.631       99.993
SET     325.631       99.994
SET     325.631       99.994
SET     325.631       99.995
SET     325.631       99.995
SET     327.679       99.995
SET     327.679       99.995
SET     327.679       99.996
SET     329.727       99.996
SET     329.727       99.996
SET     329.727       99.997
SET     329.727       99.997
SET     331.775       99.997
SET     331.775       99.997
SET     331.775       99.997
SET     331.775       99.998
SET     331.775       99.998
SET     331.775       99.998
SET     333.823       99.998
SET     333.823       99.998
SET     333.823       99.998
[...]
SET     339.967       99.999
SET     339.967       99.999
SET     339.967       99.999
[...]
SET     342.015       99.999
SET     342.015      100.000
---
GET       0.423        0.000
GET      14.335        5.000
GET      14.911       10.000
GET      15.807       15.000
GET      17.919       20.000
GET      18.303       25.000
GET      18.559       30.000
GET      18.815       35.000
GET      19.071       40.000
GET      19.199       45.000
GET      19.327       50.000
GET      19.455       52.500
GET      19.583       55.000
GET      19.583       57.500
GET      19.711       60.000
GET      19.711       62.500
GET      19.839       65.000
GET      19.967       67.500
GET      19.967       70.000
GET      20.095       72.500
GET      20.223       75.000
GET      20.223       76.250
GET      20.351       77.500
GET      20.351       78.750
GET      20.351       80.000
GET      20.479       81.250
GET      20.479       82.500
GET      20.607       83.750
GET      20.607       85.000
GET      20.735       86.250
GET      20.735       87.500
GET      20.863       88.125
GET      20.863       88.750
GET      20.863       89.375
GET      20.991       90.000
GET      20.991       90.625
GET      20.991       91.250
GET      21.119       91.875
GET      21.119       92.500
GET      21.247       93.125
GET      21.247       93.750
GET      21.247       94.062
GET      21.375       94.375
GET      21.375       94.688
GET      21.375       95.000
GET      21.375       95.312
GET      21.503       95.625
GET      21.503       95.938
GET      21.503       96.250
GET      21.631       96.562
GET      21.631       96.875
GET      21.631       97.031
GET      21.759       97.188
GET      21.759       97.344
GET      21.759       97.500
GET      21.887       97.656
GET      21.887       97.812
GET      21.887       97.969
GET      22.015       98.125
GET      22.015       98.281
GET      22.143       98.438
GET      22.143       98.516
GET      22.143       98.594
GET      22.271       98.672
GET      22.271       98.750
GET      22.271       98.828
GET      22.399       98.906
GET      22.527       98.984
GET      22.527       99.062
GET      22.655       99.141
GET      22.783       99.219
GET      22.911       99.258
GET      23.039       99.297
GET      23.167       99.336
GET      23.295       99.375
GET      23.551       99.414
GET      23.679       99.453
GET      23.807       99.492
GET      24.063       99.531
GET      24.319       99.570
GET      24.575       99.609
GET      24.575       99.629
GET      24.703       99.648
GET      24.831       99.668
GET      24.831       99.688
GET      24.959       99.707
GET      25.087       99.727
GET      25.087       99.746
GET      25.215       99.766
GET      25.215       99.785
GET      25.343       99.805
GET      25.343       99.814
GET      25.471       99.824
GET      25.471       99.834
GET      25.599       99.844
GET      25.727       99.854
GET      25.727       99.863
GET      25.855       99.873
GET      25.855       99.883
GET      25.983       99.893
GET      25.983       99.902
GET      26.111       99.907
GET      26.111       99.912
GET      26.111       99.917
GET      26.239       99.922
GET      26.239       99.927
GET      26.367       99.932
GET      26.367       99.937
GET      26.495       99.941
GET      26.623       99.946
GET      26.751       99.951
GET      26.751       99.954
GET      26.879       99.956
GET      27.135       99.958
GET      27.647       99.961
GET      28.287       99.963
GET      28.671       99.966
GET      29.055       99.968
GET      29.823       99.971
GET      30.591       99.973
GET      31.103       99.976
GET      31.743       99.977
GET      32.383       99.978
GET     307.199       99.979
GET     311.295       99.980
GET     313.343       99.982
GET     315.391       99.983
GET     317.439       99.984
GET     319.487       99.985
GET     319.487       99.987
GET     321.535       99.988
GET     321.535       99.988
GET     321.535       99.989
GET     323.583       99.990
GET     323.583       99.990
GET     323.583       99.991
GET     323.583       99.991
GET     323.583       99.992
GET     323.583       99.993
GET     323.583       99.993
GET     325.631       99.994
GET     325.631       99.994
GET     325.631       99.995
GET     325.631       99.995
GET     325.631       99.995
GET     327.679       99.995
GET     327.679       99.996
GET     329.727       99.996
GET     329.727       99.996
GET     329.727       99.997
GET     329.727       99.997
GET     331.775       99.997
GET     331.775       99.997
GET     331.775       99.997
GET     331.775       99.998
GET     331.775       99.998
GET     331.775       99.998
[...]
GET     333.823       99.998
GET     333.823       99.998
GET     335.871       99.998
GET     335.871       99.999
GET     339.967       99.999
GET     339.967       99.999
GET     339.967       99.999
[...]
GET     342.015       99.999
GET     342.015      100.000
---
WAIT      0.000      100.000